ИМСИТ/src/Documents/ПродажаТовара/ПродажаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТовара</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товар</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИМСИТ/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроданныхТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продавец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товар</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИМСИТ/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товар</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИМСИТ/src/Documents/ПродажаТовара/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаПоизицииТоваров Из ПозицииТоваров Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Продавец = Продавец;
		Движение.Товар = ТекСтрокаПоизицииТоваров.Товар;
		Движение.Покупатель = Покупатель;
		Движение.Сумма = ТекСтрокаПоизицииТоваров.Итого;
		Движение.КоличествоПроданныхТоваров = ТекСтрокаПоизицииТоваров.Количество;
	КонецЦикла;

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаПоизицииТоваров Из ПозицииТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Партия = ТекСтрокаПоизицииТоваров.Партия;
		Движение.Товар = ТекСтрокаПоизицииТоваров.Товар;
		Движение.Количество = ТекСтрокаПоизицииТоваров.Количество;
		Движение.Сумма = ТекСтрокаПоизицииТоваров.Итого;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
